---
kind: type
id: T:Autodesk.Revit.DB.TableMergedCell
source: html/f13b08fa-b8f9-a637-da3d-e9688e6fc041.htm
---
# Autodesk.Revit.DB.TableMergedCell

The TableMergedCell class defines a merged area of the upper-left and lower-right of a table grid.

## Syntax (C#)
```csharp
public class TableMergedCell : IDisposable
```

## Remarks
A TableMergedCell contains member variables that define the top-left and bottom-right row and column indexes of a table grid.
 A TableMergedCell object can be passed as a function parameter wherever a TableMergedCell can be passed.